In [2]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

import pandas as pd 

data = [4,8,15,16,23,42]
series_list = pd.Series(data)
print(series_list)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.

data1= [1,2,3,4,5,6,7,8,9,10]
my_series = pd.Series(data1)
print(my_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [4]:
#Q3. Create a Pandas DataFrame that contains the following data:

data2 = {'Name' : ['Alice','Bob','Clarie'],
         'Age'  : [25 , 30 , 27],
         'Gender':['Female','Male','Female']
        }
df = pd.DataFrame(data2)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

In [ ]:
#What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Data frame is a two-dimensional structure that is designed to handle tabular form of data as sql or spreadsheet.
it is most common data structure used in pandas . Data frame is a collection of pandas series where every column is
series.

Series is one-dimensional structure that is designed to represent a single column of data .

for example : As we can see the above question 1 and 3 that is a example of series and data frame .
In example 1 i create a series that represent a single column of data .
In example 2 i create a data frame using collection of series of data.

In [6]:
#What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#you give an example of when you might use one of these functions?

df.head(2) #this is used to extract data from beginning  side.

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [7]:
df.tail(2) #this is  used to extract data from end side.

     Name  Age  Gender
1     Bob   30    Male
2  Clarie   27  Female

In [8]:
df.columns  #this is used to print columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [9]:
type(df) #this is used to check type

pandas.core.frame.DataFrame

In [10]:
df['Age'] #this is use to extract data from specific columns

0    25
1    30
2    27
Name: Age, dtype: int64

In [ ]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

in pandas both Data frame and Series are mutable but panel is immutable.

In [ ]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

names  = pd.Series(['Alice' , 'Bob' , 'Clarie'])
age  = pd.Series([25 , 30 , 27)]
gender = pd.Series(['Female' , 'Male' , 'Female'])

data4 = {'Name' : names ,'Age' : age 'Gender' : gender}
 
       df = pd.DataFrame(data4)          
print(